{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\lcyhk\Desktop\Assign2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}27 Feb 2024, 06:42:25

{com}. ********************************************************************************

. 
. ***** Mutual fund holdings and Russell 1000/2000 index membership *****

. 
. ********************************************************************************

. 
. 
. 
. ***** CRSP mutual fund *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\CRSP_mutual fund.dta", clear

. 
. sort crsp_fundno crsp_portno

. 
. format crsp_portno %10.0g

. 
. duplicates drop crsp_fundno, force

{p 0 4}{txt}Duplicates in terms of {res} crsp_fundno{p_end}

{txt}(19,154 observations deleted)

{com}. 
. 
. 
. * Identify whether the index fund is active or passive 

. 
. gen passive = strmatch(fund_name, "*Index*" "*Idx*" "*Indx*" "*Ind *" "*Russell*" "*S & P*" "*S and P*" "*S&P*" "*SandP*" "*SP*" "*DOW*" "*Dow*" "*DJ*" "*MSCI*" "*Bloomberg*" "*KBW*" "*NASDAQ*" "*NYSE*" "*STOXX*" "*FTSE*" "*Wilshire*" "*Morningstar*" "*100*" "*400*" "*500*" "*600*" "*900*" "*1000*" "*1500*" "*2000*" "*5000*")

. 
. replace passive = 1 if index_fund_flag != ""
{txt}(3,941 real changes made)

{com}. 
. replace passive = 2 if passive == 0
{txt}(52,359 real changes made)

{com}. 
. sort crsp_fundno

. 
. 
. 
. ***** Merge CRSP_mutual fund with MFLINK 1 *****

. 
. merge m:1 crsp_fundno using "C:\Users\lcyhk\Desktop\raw data\mflink1_raw.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          38,394
{txt}{col 9}from master{col 30}{res}          35,368{txt}  (_merge==1)
{col 9}from using{col 30}{res}           3,026{txt}  (_merge==2)

{col 5}Matched{col 30}{res}          23,540{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 3
{txt}(38,394 observations deleted)

{com}. 
. duplicates drop wficn, force

{p 0 4}{txt}Duplicates in terms of {res} wficn{p_end}

{txt}(16,410 observations deleted)

{com}. 
. keep wficn passive

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** Merge with MFLINK 2 *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\mflink2_raw.dta", clear

. 
. merge m:1 wficn using "C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}         895,275
{txt}{col 9}from master{col 30}{res}         895,271{txt}  (_merge==1)
{col 9}from using{col 30}{res}               4{txt}  (_merge==2)

{col 5}Matched{col 30}{res}         312,119{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 2 | _merge == 3
{txt}(895,271 observations deleted)

{com}. 
. drop _merge

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1_mflink2.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1_mflink2.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** Thomson Reuters S12 *****

. 
. * Used Python (filename: "populate_missingdata.ipynb") to populate missing values in S12 that are prior to year 2004 & the quarterly gap <= 2

. 
. * Data has been stored to "C:\Users\lcyhk\Desktop\raw data\S12_screened.dta"

. 
. 
. 
. ***** CRSP-stock *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\CRSP_stock.dta", clear

. 
. rename (PERMNO NCUSIP PERMCO CUSIP PRC SHROUT CFACPR CFACSHR) (permno ncusip permco cusip prc shrout cfacpr cfacshr)
{res}
{com}. 
. gen year = year(date)

. 
. gen month = month(date)

. 
. keep if inlist(month, 3, 6, 9, 12)
{txt}(693,875 observations deleted)

{com}. 
. drop if year < 1998 | year > 2006
{txt}(66,049 observations deleted)

{com}. 
. 
. 
. * Calculate market capitalization

. 
. gen share_outst = shrout * 1000
{txt}(1,692 missing values generated)

{com}. 
. gen price = abs(prc) * cfacpr
{txt}(9,889 missing values generated)

{com}. 
. gen market_cap = price * share_outst * cfacshr
{txt}(9,889 missing values generated)

{com}. 
. bysort year month permco: egen co_cap = sum(market_cap)

. 
. gen cusip_merge = ncusip
{txt}(1,370 missing values generated)

{com}. 
. drop if cusip_merge == ""
{txt}(1,370 observations deleted)

{com}. 
. *duplicates drop cusip_merge year month, force

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\CRSP_stock.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\CRSP_stock.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. * Historical cusip should be related to cusip in Thomosn Reuters S12

. 
. * Merge with S12_screened file

. 
. use "C:\Users\lcyhk\Desktop\raw data\S12_screened.dta", clear

. 
. merge m:1 cusip_merge year month using "C:\Users\lcyhk\Desktop\Intermediate data\CRSP_stock.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}       1,624,237
{txt}{col 9}from master{col 30}{res}       1,587,231{txt}  (_merge==1)
{col 9}from using{col 30}{res}          37,006{txt}  (_merge==2)

{col 5}Matched{col 30}{res}      29,351,158{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge

. 
. 
. 
. * Delete observations where total mutual fund holdings exceed a stock's capitalization

. 
. sort cusip year month

. 
. gen cap_stock = shares * price
{txt}(1,661,619 missing values generated)

{com}. 
. bysort cusip_merge year month permco: egen cap_fund = total(cap_stock)

. 
. drop if cap_fund > co_cap
{txt}(1,513,010 observations deleted)

{com}. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\S12_CRSP.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\S12_CRSP.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** Merge with S12 *****

. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\CRSPmutual_mflink1_mflink2.dta", clear

. 
. gen year = year(fdate)
{txt}(4 missing values generated)

{com}. 
. gen month = month(fdate)
{txt}(4 missing values generated)

{com}. 
. duplicates drop fundno year month, force

{p 0 4}{txt}Duplicates in terms of {res} fundno year month{p_end}

{txt}(3 observations deleted)

{com}. 
. merge 1:m fundno year month using "C:\Users\lcyhk\Desktop\Intermediate data\S12_CRSP.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      14,744,052
{txt}{col 9}from master{col 30}{res}         184,293{txt}  (_merge==1)
{col 9}from using{col 30}{res}      14,559,759{txt}  (_merge==2)

{col 5}Matched{col 30}{res}      14,902,626{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. keep if _merge == 2 | _merge == 3
{txt}(184,293 observations deleted)

{com}. 
. replace passive = 3 if missing(passive)
{txt}(14,559,759 real changes made)

{com}. 
. drop _merge

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\merged.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\merged.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ********************************************************************************

. 
. ***** Link to Russell *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\russell_all.dta", clear

. 
. tostring yearmonth, gen (newdate)
{txt}newdate generated as {res:str3}

{com}. 
. destring newdate, replace
{txt}newdate: all characters numeric; {res}replaced {txt}as {res}int

{com}. 
. gen year = 1998 + (newdate - 461)/12

. 
. gen month = 6

. 
. rename cusip cusip_merge
{res}
{com}. 
. drop newdate

. 
. merge 1:m cusip_merge year month using "C:\Users\lcyhk\Desktop\Intermediate data\merged.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      23,526,745
{txt}{col 9}from master{col 30}{res}           1,078{txt}  (_merge==1)
{col 9}from using{col 30}{res}      23,525,667{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       5,936,718{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. *keep if inlist(month, 6, 9)

. 
. format share_outst market_cap co_cap cap_fund %20.0g

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\merged_Russell.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\merged_Russell.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. * Select firms in the 250 bandwidth around the cutoff between the Russell 1000 and 2000 indexes

. 
. ***** Choose firm that are bottom 250 in Russell 1000 *****

. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\merged_Russell.dta", clear

. 
. keep if r2000 == 0
{txt}(25,105,246 observations deleted)

{com}. 
. duplicates drop cusip_merge year, force

{p 0 4}{txt}Duplicates in terms of {res} cusip_merge year{p_end}

{txt}(4,349,234 observations deleted)

{com}. 
. sort year adj_mrktvalue

. 
. by year: gen rank_r = _n

. 
. gen bottom_250 = rank_r <= 250  

. 
. keep if bottom_250 == 1
{txt}(6,733 observations deleted)

{com}. 
. keep year cusip_merge r2000 bottom_250

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\bottom250.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\bottom250.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** Choose firm that are top 250 in Russell 2000 *****

. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\merged_Russell.dta", clear

. 
. keep if r2000 == 1
{txt}(27,883,884 observations deleted)

{com}. 
. duplicates drop cusip_merge year, force

{p 0 4}{txt}Duplicates in terms of {res} cusip_merge year{p_end}

{txt}(1,561,577 observations deleted)

{com}. 
. sort year adj_mrktvalue

. 
. by year: gen rank_r = _n

. 
. gen top_250 = rank_r > (_N - 250)

. 
. keep if top_250 == 1
{txt}(15,752 observations deleted)

{com}. 
. keep year cusip_merge r2000 top_250

. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\top250.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\top250.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** Merge firms around the 250 bandwidth with Russell index *****

. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\merged_Russell.dta", clear

. 
. drop _merge

. 
. merge m:1 cusip_merge year using "C:\Users\lcyhk\Desktop\Intermediate data\bottom250.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      27,943,704
{txt}{col 9}from master{col 30}{res}      27,943,704{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,519,759{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge

. 
. merge m:1 cusip_merge year using "C:\Users\lcyhk\Desktop\Intermediate data\top250.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}      28,021,758
{txt}{col 9}from master{col 30}{res}      28,021,758{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}Matched{col 30}{res}       1,441,705{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop _merge

. 
. keep if bottom_250 == 1 | top_250 == 1
{txt}(26,501,999 observations deleted)

{com}. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\completed.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\completed.dta{rm}
saved
{p_end}

{com}. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\completed.dta", clear

. 
. keep if month == 6
{txt}(2,215,365 observations deleted)

{com}. 
. 
. 
. * % of shares outstanding held by mutual funds in September of year t; the result in June and September are similar, here use June's result as it is more close to the original result

. 
. gen tot_shr = shares / (shr * cfacshr * 1000)
{txt}(219 missing values generated)

{com}. 
. drop if missing(shares) | shares == 0
{txt}(174 observations deleted)

{com}. 
. bysort permco year: egen total_share = sum(tot_shr)

. 
. bysort permco year: egen total_shares = max(total_share)

. 
. replace total_shares = total_shares * 100
{txt}(745,880 real changes made)

{com}. 
. bysort permco year: egen Passive = sum(tot_shr) if passive == 1
{txt}(575,836 missing values generated)

{com}. 
. bysort permco year: egen Passive_share = max(Passive) 
{txt}(268 missing values generated)

{com}. 
. replace Passive_share = Passive_share * 100
{txt}(745,612 real changes made)

{com}. 
. bysort permco year: egen Active = sum(tot_shr) if passive == 2
{txt}(417,396 missing values generated)

{com}. 
. bysort permco year: egen Active_share = max(Active) 

. 
. replace Active_share = Active_share * 100
{txt}(745,880 real changes made)

{com}. 
. bysort permco year: egen Unclassified = sum(tot_shr) if passive == 3
{txt}(498,618 missing values generated)

{com}. 
. bysort permco year: egen Unclassified_share = max(Unclassified)
{txt}(43 missing values generated)

{com}. 
. replace Unclassified_share = Unclassified_share * 100
{txt}(745,837 real changes made)

{com}. 
. 
. 
. duplicates drop cusip_merge year, force

{p 0 4}{txt}Duplicates in terms of {res} cusip_merge year{p_end}

{txt}(741,599 observations deleted)

{com}. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\mutual fund.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\mutual fund.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ********************************************************************************

. 
. ***** Governance, voting, accounting, and compensation data *****

. 
. ********************************************************************************

. 
. 
. 
. ***** ISS-Director *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\ISS_director.dta", clear

. 
. drop if CLASSIFICATION == "L"
{txt}(19,732 observations deleted)

{com}. 
. gen year = year(MEETINGDATE)

. 
. sort CUSIP year DIRECTOR_DETAIL_ID

. 
. gen inde_dic = 0

. 
. gen tot_dic = 1

. 
. replace inde_dic = 1 if CLASSIFICATION == "I"
{txt}(89,253 real changes made)

{com}. 
. 
. 
. * Calculate no. of independent directors and total directors for each firm in each year

. 
. bysort CUSIP year: egen num_inde_dic = sum(inde_dic)

. 
. bysort CUSIP year: egen num_tot_dic = sum(tot_dic)

. 
. gen independent_director = num_inde_dic / num_tot_dic * 100

. 
. rename CUSIP cusip6
{res}
{com}. 
. keep cusip6 year independent_director

. 
. duplicates drop cusip6 year, force

{p 0 4}{txt}Duplicates in terms of {res} cusip6 year{p_end}

{txt}(101,765 observations deleted)

{com}. 
. 
. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\independent_director.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\independent_director.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** ISS-Governance *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\iss_governance.dta", clear

. 
. rename (CN6 YEAR DUALCLASS PPILL LSPMT) (cusip6 year dualclass ppill lspmt)
{res}
{com}. 
. recast int (dualclass ppill lspmt)

. 
. format %6.0g (dualclass ppill lspmt)

. 
. sort cusip6 year

. 
. 
. 
. * Indicator for Poison pill removal equals to 1 if a firm's poison pill is either withdrawn or allowed to expire at time t, and zero otherwise

. 
. by cusip6: gen poison_removal = 1 if ppill == 0 & ppill[_n-1] == 1
{txt}(9,391 missing values generated)

{com}. 
. replace poison_removal = 0 if missing(poison_removal)
{txt}(9,391 real changes made)

{com}. 
. 
. 
. * Indicator for Greater ability to call special meeting equals to 1 if shareholders are better able to call a special meeting at time t, and zero otherwise

. 
. by cusip6: gen greater_ability = 1 if lspmt == 0 & lspmt[_n-1] == 1
{txt}(9,519 missing values generated)

{com}. 
. replace greater_ability = 0 if missing(greater_ability)
{txt}(9,519 real changes made)

{com}. 
. 
. 
. save "C:\Users\lcyhk\Desktop\Intermediate data\iss_governance.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Intermediate data\iss_governance.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ***** ROA *****

. 
. use "C:\Users\lcyhk\Desktop\raw data\roa.dta", clear

. 
. gen cusip8 = substr(cusip,1,8)
{txt}(13 missing values generated)

{com}. 
. gen year = year(datadate)

. 
. drop if missing(ni) | missing(at)
{txt}(10,080 observations deleted)

{com}. 
. gen roa = ni / at
{txt}(396 missing values generated)

{com}. 
. winsor roa, gen(ROA) p(0.01)

. 
. duplicates drop cusip8 year, force

{p 0 4}{txt}Duplicates in terms of {res} cusip8 year{p_end}

{txt}(213 observations deleted)

{com}. 
. keep cusip cusip8 year ROA 

. 
. rename cusip8 cusip_merge
{res}
{com}. 
. save "C:\Users\lcyhk\Desktop\Processed_data\roa.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Processed_data\roa.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. ********************************************************************************

. 
. ***** Merge the above data with the main dataset *****

. 
. use "C:\Users\lcyhk\Desktop\Intermediate data\mutual fund.dta", clear

. 
. merge m:1 cusip6 year using "C:\Users\lcyhk\Desktop\Intermediate data\independent_director.dta"
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          13,540
{txt}{col 9}from master{col 30}{res}           1,743{txt}  (_merge==1)
{col 9}from using{col 30}{res}          11,797{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           2,583{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop if _merge == 2
{txt}(11,797 observations deleted)

{com}. 
. drop _merge

. 
. 
. 
. merge m:1 cusip6 year using "C:\Users\lcyhk\Desktop\Intermediate data\iss_governance.dta"
{res}{txt}{p 0 7 2}
(variable
{bf:cusip6} was {bf:str6}, now {bf:str8} to accommodate using data's values)
{p_end}
{p 0 7 2}
(variable
{bf:year} was {bf:float}, now {bf:double} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          10,445
{txt}{col 9}from master{col 30}{res}           2,599{txt}  (_merge==1)
{col 9}from using{col 30}{res}           7,846{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           1,727{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop if _merge == 2
{txt}(7,846 observations deleted)

{com}. 
. drop _merge

. 
. 
. 
. merge m:1 cusip_merge year using "C:\Users\lcyhk\Desktop\Processed_data\roa.dta"
{res}{txt}{p 0 7 2}
(variable
{bf:cusip} was {bf:str8}, now {bf:str10} to accommodate using data's values)
{p_end}

{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}          92,138
{txt}{col 9}from master{col 30}{res}           1,282{txt}  (_merge==1)
{col 9}from using{col 30}{res}          90,856{txt}  (_merge==2)

{col 5}Matched{col 30}{res}           3,044{txt}  (_merge==3)
{col 5}{hline 41}

{com}. 
. drop if _merge == 2
{txt}(90,856 observations deleted)

{com}. 
. drop cusip6 yearmonth switch2to1 switch1to2 fdate mgrcoab rdate assets ioc prdate country num_holdings passive date NAMEENDT cap_stock cap_fund tot_shr _merge

{com}. 
.
.
.
. save "C:\Users\lcyhk\Desktop\Processed_data\main data.dta", replace
{txt}{p 0 4 2}
file {bf}
C:\Users\lcyhk\Desktop\Processed_data\main data.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\lcyhk\Desktop\Assign2.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}27 Feb 2024, 07:11:38
{txt}{.-}
{smcl}
{txt}{sf}{ul off}